import React, { Component } from 'react'
import {Container, Row, Col} from 'react-bootstrap'
class Policy extends Component {
    render() {
        return(
            <Container className="containBox">
                <Row className="justify-content-md-center">
                    <Col xs="auto"><h5 className="topic">ข้อตกลงการใช้งาน</h5></Col>
                </Row>
                <Row className="justify-content-md-center">
                    <Col md="12" lg="9">
                        <div className="txtProfile">
                            <p className="txtHead">เกี่ยวกับเว็บไซต์</p>
                            <p className="txtDetail">เว็บไซต์นี้จัดทำขึ้นเพื่อให้ผู้ที่กำลังเตรียมตัวสอบครูผู้ช่วย สาขาคอมพิวเตอร์ ทุกสังกัด
                            ได้ฝึกฝนทำข้อสอบก่อนลงสนามสอบจริง ซึ่งข้อสอบเหล่านี้ได้ถูกรวบรวมมาจากผู้ที่มีประสบการณ์การสอบมานับครั้งไม่ถ้วน
                            รวมถึงการแบ่งปันเป็นวิทยาทานความรู้ นอกจากนี้ข้อสอบได้มีการปรับปรุงแก้ไขตลอดเวลา เพื่อให้ทันต่อสถานการณ์ปัจจุบัน
                            </p>
                            <p className="txtHead">ขั้นตอนการเลือกแพลน และขอรับสิทธิ์</p>
                            <p className="txtDetail">สำหรับแพลนการใช้งานมีทั้งหมด 3 รูปแบบ ผู้เข้าทดสอบจะต้องเลือกอย่างใดอย่างหนึ่ง
                            หลังจากเลือกแพลนเสร็จ ในกรณีที่เลือกแบบที่ 2 และ 3 จะต้องแจ้งให้ผู้ดูแลระบบทราบ เพื่อที่จะได้อนุมัติสิทธิ์การเข้าใช้งาน
                            ยกเว้นกรณีที่เลือก แบบที่ 1 สามารถเข้าใช้งานได้ทันที แต่จะมีข้อจำกัดบางอย่างตามที่ได้แจ้งไว้ 
                            </p>
                            <p className="txtHead">การลงทะเบียนเข้าใช้งาน</p>
                            <p className="txtDetail">ผู้เข้าทดสอบจะต้องลงทะเบียนทุกครั้งก่อนเข้าใช้งาน เพื่อให้ระบบตรวจสอบความถูกต้อง
                            สำหรับข้อมูลการลงทะเบียน ทางเว็บไซต์มีการเก็บข้อมูลอีเมล ชื่อ และนามสกุล เพื่อที่จะระบุตัวตนของผู้ทดสอบเท่านั้น ไม่มีการเก็บข้อมูลสำคัญใด ๆ 
                            ทั้งสิ้น
                            </p>
                            <p className="txtHead">ก่อนจากกัน</p>
                            <p className="txtDetail">ทางเว็บไซต์ขอขอบคุณทุกท่านที่มาร่วมทดสอบกับเรา ขอให้ทุกท่านได้บรรจุสมหวังดังใจปอง 
                            ข้อสอบทุกข้อที่มีอยู่ในระบบ ล้วนถูกคัดกรองแล้วเป็นอย่างดี รวมไปถึงเนื้อหาต่าง ๆ ที่ครอบคลุมหลักสูตรการสอบในแต่ละสังกัด
                            ขอให้ผู้ทดสอบ อย่าละความพยายาม และอย่าทิ้งเป้าหมายที่ตั้งไว้ หากว่างเมื่อไหร่ก็แวะมา พร้อมเปิดรอทุกท่านเสมอ สุดท้ายนี้ ขอให้โชคดีมีชัยในการสอบด้วยเทอญ
                            </p>
                            <p></p>
                            <p className="txtDetail">ผู้ดูแลระบบ</p>
                            <p></p>
                            
                        </div>
                    </Col>
                </Row>
            </Container>
        );
    }
}
export default Policy
